---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraints
source: html/16bfda04-5184-786f-5989-2fae9f51ebf9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraints Property

A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..

## Syntax (C#)
```csharp
public static FailureDefinitionId UndeletedConstraints { get; }
```